fraserb99/ee579-msp430/main.c
        } else if (led2_blink == -2){
            led2_active = 0;
            P1OUT &= ~ BIT6;
            deactivate_timer(activated_led2, 1);
            led2_blink = -1;
        }

        //fade in


        //LED3 on/off
        if(led3_on){
            if (!led3_active) {
              P2DIR |= BIT1 + BIT3 + BIT5;        // P1.0 output
              //LED D3, on set colour
              P2OUT = colours[colour];
            }

        } else if(led3_on == -1){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_active = 0;                    //not active anymore
            led3_on = 0;
        }

        //circling
        if(led3_rot > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_rot = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, wanted colour
                P2OUT = colours[colour];
            }

        } else if(led3_rot == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_rot = -1;

        }

        //blinking
        if(led3_blink > -1){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_blink = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //for testing
                    P1OUT ^= BIT6;
                }
                //toggle LED D3, with start colour
                P2OUT = colours[colour];
                //indicate on
                led3_blink_on = 1;
            }

        } else if(led3_blink == -2){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_blink = -1;
        }
    }

}

//interrupts
//timer A0
#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
    //check for how long button was pressed
    if ((button == 0) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timerCount += 1;

        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            //send timer count signal here
            //led1_fade_out = 1;
            //led1_breath = 1;
            //testing with light first
           // P1OUT ^= BIT0;
            held = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA0CCR0 += count_b;
    } else if (button == 0){ //check that it is the button debouncing
        if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
             timerCount = 0;                     //Reset the timer count
             pressed = 0;                        //reset pressed
             held = 1;                           //Button is being held
             //P1OUT ^= BIT6;
             //offset TA0CCR0 by the count number/period
             //change the value held in the array
             timers_used[0] = count_b;
             TA0CCR0 += count_b;

        } else {
            pressed = 0;                         //Button is not being pressed
        }

     }

    //thermometer stuff
    if(thermometer == 0){
        if (!stable){
            stable = 1;
            //get original value, if possible here
            ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
            temp = ADC10MEM;
            // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
            orig_temp = ((temp - 673) * 423) / 1024;
            TA0CCR0 = sample_temp_time;

        } else {
            sample_temp = 1;        //start a sample
        }

        TA0CCR0 += sample_temp_time;
    }

    //outputs
    //LED1 blinking
    if(led1_blink == 0){
        P1OUT ^= BIT0;
        TA0CCR0 += blink_rate_1;
    }

    //fading in, part 1,
    if((led1_fade_in == 10) || (led1_fade_in == 11) || (led1_fade_in == 12) || (led1_fade_in == 13) || (led1_fade_in == 14)){
        P1OUT |= BIT0;                              //Turn on light
        switch(led1_fade_in){
        case 10:
            TA0CCR1 = light_values_fading[counter_val_1];           //Change the timer count for the "duty cycle";
            break;
        case 11:
            TA0CCR2 = light_values_fading[counter_val_1];
            break;
        case 12:
            TA1CCR0 = light_values_fading[counter_val_1];
            break;
        case 13:
            TA1CCR1 = light_values_fading[counter_val_1];
            break;
        case 14:
            TA1CCR2 = light_values_fading[counter_val_1];
            break;
        }

        counter_val_1 += 1;                             //Increment the value to read from the array

        if(counter_val_1 == sizeof(light_values_fading)){       //set led1_fade_in to 1;
            led1_fade_in = -1;
        }
        timers_used[0] = count_b;
        TA0CCR0 += period_1;
    }

    //breathing light
    if((led1_breath == 10) || (led1_breath == 11) || (led1_breath == 12) || (led1_breath == 13) || (led1_breath == 14)){
        P1OUT |= BIT0;                              //Turn on light
        switch(led1_breath){
        case 10:
            TA0CCR1 += light_values_breathing[counter_val_1];           //Change the timer count for the "duty cycle";
            timers_used[1] = count_b;
            break;
        case 11:
            TA0CCR2 += light_values_breathing[counter_val_1];
            timers_used[2] = count_b;
            break;
        case 12:
            TA1CCR0 += light_values_breathing[counter_val_1];
            timers_used[3] = count_b;
            break;
        case 13:
            TA1CCR1 += light_values_breathing[counter_val_1];
            timers_used[4] = count_b;
            break;
        case 14:
            TA1CCR2 += light_values_breathing[counter_val_1];
            timers_used[5] = count_b;
            break;
        }

        counter_val_1 += 1;                             //Increment the value to read from the array

        if(counter_val_1 == sizeof(light_values_breathing)){       //set led1_fade_in to 1;
            counter_val_1 = 0;
        }
        TA0CCR0 += period_1;
    }

    //fading out, part 1,
    if((led1_fade_out == 10) || (led1_fade_out == 11) || (led1_fade_out == 12) || (led1_fade_out == 13) || (led1_fade_out == 14)){
        P1OUT |= BIT0;                              //Turn on light
        switch(led1_fade_out){
        case 10:
            TA0CCR1 = light_values_fading[counter_val_1];           //Change the timer count for the "duty cycle";
            break;
        case 11:
            TA0CCR2 = light_values_fading[counter_val_1];
            break;
        case 12:
            TA1CCR0 = light_values_fading[counter_val_1];
            break;
        case 13:
            TA1CCR1 = light_values_fading[counter_val_1];
            break;
        case 14:
            TA1CCR2 = light_values_fading[counter_val_1];
            break;
        }

        counter_val_1 -= 1;                             //Decrement the value to read from the array

        if(counter_val_1 == 0){       //set led1_fade_in to 1;
            led1_fade_out = -2;       //deactivate
        }
        timers_used[0] = count_b;
        TA0CCR0 += period_1;
    }

    //LED2 blinking
    if(led2_blink == 0){
        P1OUT ^= BIT6;
        TA0CCR0 += blink_rate_2;
    }

    //LED3 rotating
    if(led3_rot == 0){
        //verify boundaries
        if ((colour == 0) && (led3_dir == -1)){
            colour = 6;
        } else if ((colour == 6) && (led3_dir == 1)){
            colour = 0;
        } else {
            colour = colour + led3_dir; //change colour based on direction
        }
        //swap colour
        P2OUT = colours[colour];
        TA0CCR0 += blink_rate_3;
    }
    //LED3 blink
    if(led3_blink == 0){
        if(led3_blink_on){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_blink_on = 0;
            TA0CCR0 += blink_rate_3;
        } else {
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            led3_blink_on = 1;
            //swap colour
            P2OUT = colours[colour];
            TA0CCR0 += blink_rate_3;
        }
    }
}

