fraserb99/ee579-msp430/main.c
         }


        //thermometer stuff
        if(thermometer == 2){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

            } else {
                sample_temp = 1;        //start a sample
            }

            //TA0CCR2 += sample_temp_time;
        }

        //outputs
        //LED1 blinking
        if(led1_blink == 2){
            P1OUT ^= BIT0;
            TA0CCR2 += blink_rate_1;
        }

        //fading in, part 1
        if((led1_fade_in == 19) || (led1_fade_in == 20) || (led1_fade_in == 20)){
            P1OUT |= BIT0;                              //Turn on light
            switch(led1_fade_in){
            case 19:
                timers_used[3] = count_b;
                TA1CCR0 = light_values_fading[counter_val_1];
                break;
            case 20:
                timers_used[4] = count_b;
                TA1CCR1 = light_values_fading[counter_val_1];
                break;
            case 21:
                timers_used[5] = count_b;
                TA1CCR2 = light_values_fading[counter_val_1];
                break;
            }

            counter_val_1 += 1;                             //Increment the value to read from the array

            if(counter_val_1 == sizeof(light_values_fading)){       //set led1_fade_in to 1;
                led1_fade_in = -1;
            }
            timers_used[0] = count_b;
            TA0CCR2 += period_1;
        }

        //breathing light
        if((led1_breath == 19) || (led1_breath == 20) || (led1_breath == 21)){
            P1OUT |= BIT0;                              //Turn on light
            switch(led1_breath){
            case 19:
                TA1CCR0 += light_values_breathing[counter_val_1];
                timers_used[3] = count_b;
                break;
            case 20:
                TA1CCR1 += light_values_breathing[counter_val_1];
                timers_used[4] = count_b;
                break;
            case 21:
                TA1CCR2 += light_values_breathing[counter_val_1];
                timers_used[5] = count_b;
                break;
            }

            counter_val_1 += 1;                             //Increment the value to read from the array

            if(counter_val_1 == sizeof(light_values_breathing)){       //set led1_fade_in to 1;
                counter_val_1 = 0;
            }
            TA0CCR2 += period_1;
        }

        //fading out, part 1,
        if((led1_fade_out == 19) || (led1_fade_out == 20) || (led1_fade_out == 21)){
            P1OUT |= BIT0;                              //Turn on light
            switch(led1_fade_out){
            case 19:
                timers_used[3] = count_b;
                TA1CCR0 = light_values_fading[counter_val_1];
                break;
            case 20:
                timers_used[4] = count_b;
                TA1CCR1 = light_values_fading[counter_val_1];
                break;
            case 21:
                timers_used[5] = count_b;
                TA1CCR2 = light_values_fading[counter_val_1];
                break;
            }

            counter_val_1 -= 1;                             //Decrement the value to read from the array

            if(counter_val_1 == 0){       //set led1_fade_in to 1;
                led1_fade_out = -2;
            }
            timers_used[0] = count_b;
            TA0CCR2 += period_1;
        }

        //fade in part 2, breathing part 2, fade out part 2,
        if((led1_fade_in == 11) || (led1_fade_out == 11) || (led1_fade_in == 15) || (led1_fade_out == 15)) {
            P1OUT &= ~BIT0;                     //Turn off light
            TA0CCR2 += light_values_fading[counter_val_1];
        }

        if((led1_breath == 10) || (led1_breath == 15)){
            P1OUT &= ~BIT0;                     //Turn off light
            TA0CCR2 += light_values_breathing[counter_val_1];
        }

        //LED2 blinking
        if(led2_blink == 2){
            P1OUT ^= BIT6;
            //TA0CCR2 += blink_rate_2;
        }

        //LED3 rotating
        if(led3_rot == 2){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 6;
            } else if ((colour == 6) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA0CCR2 += blink_rate_3;
        }

        //LED3 blink
        if(led3_blink == 1){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                //TA0CCR2 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 6;
                } else if ((colour == 6) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA0CCR2 += blink_rate_3;
            }
        }
        break;

    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for time A1
#pragma vector=TIMER1_A0_VECTOR
__interrupt void Timer1_A0 (void)
{
    //button stuff
    //check for how long button was pressed
    if ((button == 3) && (held == 1)) {
        if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
            timerCount += 1;

        } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
            //send timer count signal here
            led1_blink = 1;
            //testing with light first
           // P1OUT ^= BIT0;
            held = 0;                               //button has now been released
        }
        //offset TA0CCR0 by the count number/period
        TA1CCR0 += count_b;
    } else if (button == 3){ //check that it is the button debouncing
        if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
             timerCount = 0;                     //Reset the timer count
             pressed = 0;                        //reset pressed
             held = 1;                           //Button is being held
             P1OUT ^= BIT6;
             //offset TA0CCR0 by the count number/period
             //change the value held in the array
             timers_used[0] = count_b;
             TA1CCR0 += count_b;

        } else {
            pressed = 0;                         //Button is not being pressed
        }

